esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
/*
 * Author: Ernst Sikora
 *
 * Created on: December 26, 2025
 */

#include <stdio.h>
#include <inttypes.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_chip_info.h"
#include "esp_flash.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp_random.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_7b.h"
#include "lvgl.h"
#include "iot_button.h"
#include "button_gpio.h"

#include "fonts/lv_font_dejavu_16_german.c"
#include "fonts/lv_font_dejavu_18_german.c"
#include "fonts/lv_font_dejavu_20_german.c"
#include "fonts/lv_font_dejavu_24_german.c"

#include "quiz_data.h"  // Contains quiz question data

// Define colors manually
#define LV_COLOR_RED     lv_color_make(0xFF, 0x00, 0x00)
#define LV_COLOR_GREEN   lv_color_make(0x00, 0xFF, 0x00)
#define LV_COLOR_BLUE    lv_color_make(0x00, 0x00, 0xFF)
#define LV_COLOR_WHITE   lv_color_make(0xFF, 0xFF, 0xFF)
#define LV_COLOR_BLACK   lv_color_make(0x00, 0x00, 0x00)
#define LV_COLOR_GRAY    lv_color_make(0x80, 0x80, 0x80)
#define LV_COLOR_YELLOW  lv_color_make(0xFF, 0xFF, 0x00)
#define LV_COLOR_ORANGE  lv_color_make(0xFF, 0xA5, 0x00)

// WWTBAM Color Palette
#define WWTBAM_BG            lv_color_make(0x00, 0x00, 0x33)   // deep navy
#define WWTBAM_GOLD          lv_color_make(0xFF, 0xD7, 0x00)   // gold
#define WWTBAM_BLUE          lv_color_make(0x00, 0x33, 0x99)   // bright blue
#define WWTBAM_BLUE_DARK     lv_color_make(0x00, 0x22, 0x66)
#define WWTBAM_WHITE         lv_color_make(0xFF, 0xFF, 0xFF)
#define WWTBAM_ORANGE_DARK   lv_color_make(0xE6, 0x80, 0x00)
#define WWTBAM_GREEN_DARK   lv_color_make(0x00, 0x66, 0x00)   // deeper green

#define WWTBAM_HIGHLIGHT_BG     lv_color_make(0x33, 0x33, 0x99)   // glowing blue
#define WWTBAM_HIGHLIGHT_BORDER lv_color_make(0x33, 0x99, 0xFF)   // electric blue


typedef enum {
    QUIZ_STATE_IDLE,
    QUIZ_STATE_START_SCREEN,
    QUIZ_STATE_SHOWING_QUESTION,
    QUIZ_STATE_WAITING_ANSWER,
    QUIZ_STATE_SHOWING_REACTION,
    QUIZ_STATE_WINNER,
    QUIZ_STATE_FAIL,
    QUIZ_STATE_SHUTDOWN_PROMPT
} quiz_state_t;

// === Global quiz state =======================================================

static quiz_state_t quiz_state = QUIZ_STATE_IDLE;
static int score = 0;
static int tries = 0;
static bool used_questions[NUM_QUIZ_QUESTIONS] = {false};
static int current_question_index = -1;
static int timer_remaining = 0;
static char user_answer = 0;
static lv_timer_t *quiz_timer = NULL;

// === Button information ======================================================

typedef struct {
    int gpio_num;
    lv_color_t color;
    lv_obj_t *btn_obj;       // LVGL button widget
    button_handle_t handle;  // physical button
    bool is_pressed;
} button_info_t;

#define NUM_BUTTONS 3
static button_info_t buttons[NUM_BUTTONS];

// === UI structure: all LVGL objects live here ===============================

typedef struct {
    lv_obj_t *root;                  // main container

    lv_obj_t *center_label;          // used for winner/fail/shutdown screens
    lv_obj_t *start_instr_label;     // used for start screen instructions
    lv_obj_t *question_label;
    lv_obj_t *answer_labels[3];
    lv_obj_t *countdown_label;
    lv_obj_t *reaction_label;
    lv_obj_t *score_label;
    lv_obj_t *fail_instr_label;

    lv_obj_t *answer_frames[3];
    lv_obj_t *buttons[3];            // LVGL button widgets

} quiz_ui_t;

static quiz_ui_t ui = {0};

// === Helper: Difficulty to time ============================================

static int get_timer_duration(char difficulty)
{
    switch (difficulty) {
    case 'L': return 15;
    case 'M': return 30;
    case 'H': return 45;
    default:  return 30;
    }
}

// === Question selection =====================================================

static void init_quiz_logic(void)
{
    score = 0;
    tries = 0;
    memset(used_questions, 0, sizeof(used_questions));
    current_question_index = -1;
    timer_remaining = 0;
    user_answer = 0;

    // random seed
    srand((unsigned)esp_random());
}

static int select_random_question(void)
{
    int available = 0;
    for (int i = 0; i < NUM_QUIZ_QUESTIONS; i++) {
        if (!used_questions[i]) available++;
    }

    if (available == 0) return -1;

    int target = rand() % available;
    int count = 0;
    for (int i = 0; i < NUM_QUIZ_QUESTIONS; i++) {
        if (!used_questions[i]) {
            if (count == target) {
                used_questions[i] = true;
                return i;
            }
            count++;
        }
    }
    return -1;
}

// === UI creation & update functions (no deletes!) ===========================

static void create_quiz_ui_once(void)
{
    if (ui.root) {
        // Already created
        return;
    }

    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLL_CHAIN_HOR);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLL_CHAIN_VER);

    // Root container for all quiz elements
    ui.root = lv_obj_create(scr);
    lv_obj_set_size(ui.root, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(ui.root, LV_COLOR_WHITE, LV_PART_MAIN);
    lv_obj_clear_flag(ui.root, LV_OBJ_FLAG_SCROLLABLE);

    // QUESTION BOX (framed, centered)
    ui.question_label = lv_label_create(ui.root);
    lv_obj_set_width(ui.question_label, 700);
    lv_label_set_long_mode(ui.question_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(ui.question_label, &lv_font_dejavu_24_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.question_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_set_style_text_align(ui.question_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);

    // Frame styling
    lv_obj_set_style_bg_color(ui.question_label, WWTBAM_BLUE_DARK, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(ui.question_label, LV_OPA_80, LV_PART_MAIN);
    lv_obj_set_style_border_color(ui.question_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_set_style_border_width(ui.question_label, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(ui.question_label, 16, LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui.question_label, 20, LV_PART_MAIN);

    lv_obj_align(ui.question_label, LV_ALIGN_TOP_MID, 0, 20);

    // Score label (top-left)
    ui.score_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.score_label, &lv_font_dejavu_16_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.score_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.score_label, LV_ALIGN_TOP_LEFT, 10, 10);

    // Countdown label (bottom middle)
    ui.countdown_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.countdown_label, &lv_font_dejavu_18_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.countdown_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_align(ui.countdown_label, LV_ALIGN_BOTTOM_LEFT, 10, -10);

