esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    // Reaction label (center)
    ui.reaction_label = lv_label_create(ui.root);
    lv_obj_set_style_text_align(ui.reaction_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(ui.reaction_label, &lv_font_dejavu_18_german, LV_PART_MAIN);
    lv_label_set_long_mode(ui.reaction_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(ui.reaction_label, 600);
    lv_obj_align(ui.reaction_label, LV_ALIGN_BOTTOM_MID, 0, -10);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);

    // Central label for winner/fail/shutdown screens
    ui.center_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.center_label, &lv_font_dejavu_24_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.center_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.center_label, LV_ALIGN_CENTER, 0, 0);
    lv_obj_add_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);

    // Start screen instructions label
    ui.start_instr_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.start_instr_label, &lv_font_dejavu_16_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.start_instr_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_set_style_text_align(ui.start_instr_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_label_set_long_mode(ui.start_instr_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(ui.start_instr_label, 700);
    lv_obj_align(ui.start_instr_label, LV_ALIGN_CENTER, 0, 60);
    lv_obj_add_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Additional label for fail instructions (only used in FAIL state)
    ui.fail_instr_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.fail_instr_label, &lv_font_dejavu_16_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.fail_instr_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.fail_instr_label, LV_ALIGN_BOTTOM_MID, 0, -20);
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Create LVGL button widgets (3 buttons)
    const int frame_width = 700;
    const int frame_height = 80;
    const int spacing = 20;

    for (int i = 0; i < 3; i++) {

        // Outer frame (button + text)
        ui.answer_frames[i] = lv_obj_create(ui.root);
        lv_obj_set_size(ui.answer_frames[i], frame_width, frame_height);
        lv_obj_align(ui.answer_frames[i], LV_ALIGN_CENTER, 0, (i - 1) * (frame_height + spacing));

        lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
        lv_obj_set_style_bg_opa(ui.answer_frames[i], LV_OPA_80, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.answer_frames[i], 16, LV_PART_MAIN);
        lv_obj_set_style_pad_all(ui.answer_frames[i], 10, LV_PART_MAIN);

        // BUTTON inside the frame
        ui.buttons[i] = lv_button_create(ui.answer_frames[i]);
        lv_obj_set_size(ui.buttons[i], 120, 60);
        lv_obj_align(ui.buttons[i], LV_ALIGN_LEFT_MID, 0, 0);

        lv_color_t btn_color =
            (i == 0) ? WWTBAM_BLUE :
            (i == 1) ? WWTBAM_GREEN_DARK :
                    LV_COLOR_RED;

        lv_obj_set_style_bg_color(ui.buttons[i], btn_color, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.buttons[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.buttons[i], 1, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.buttons[i], 12, LV_PART_MAIN);

        // Letter label (A/B/C)
        lv_obj_t *letter = lv_label_create(ui.buttons[i]);
        lv_label_set_text(letter, (i == 0) ? "A" : (i == 1) ? "B" : "C");
        lv_obj_set_style_text_color(letter, WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_text_font(letter, &lv_font_dejavu_20_german, LV_PART_MAIN);
        lv_obj_center(letter);

        // Answer text OUTSIDE the button, inside the frame
        ui.answer_labels[i] = lv_label_create(ui.answer_frames[i]);
        lv_obj_set_style_text_color(ui.answer_labels[i], WWTBAM_WHITE, LV_PART_MAIN);
        lv_obj_set_style_text_font(ui.answer_labels[i], &lv_font_dejavu_18_german, LV_PART_MAIN);
        lv_obj_align(ui.answer_labels[i], LV_ALIGN_LEFT_MID, 150, 0);
    }

}

static void highlight_answer_frame(int index)
{
    for (int i = 0; i < 3; i++) {
        if (i == index) {
            // Selected frame
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BG, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BORDER, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 5, LV_PART_MAIN);
        } else {
            // Reset others
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        }
    }
}

static void update_score_display(void)
{
    if (!ui.score_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Punkte: %d", score);
    lv_label_set_text(ui.score_label, buf);
}

static void update_countdown_display(void)
{
    if (!ui.countdown_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Zeit: %d", timer_remaining);
    lv_label_set_text(ui.countdown_label, buf);
}

static void show_question_ui(int q_index)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    lv_obj_clear_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);

    highlight_answer_frame(-1);  // reset highlights 

    for (int i = 0; i < 3; i++) {
        lv_obj_clear_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    lv_label_set_text(ui.question_label, quiz_questions[q_index].question);

    lv_label_set_text(ui.answer_labels[0], quiz_questions[q_index].answer_a);
    lv_label_set_text(ui.answer_labels[1], quiz_questions[q_index].answer_b);
    lv_label_set_text(ui.answer_labels[2], quiz_questions[q_index].answer_c);

    update_score_display();

    timer_remaining = get_timer_duration(quiz_questions[q_index].difficulty);
    update_countdown_display();
}

static void show_reaction_ui(bool correct)
{
    if (!ui.reaction_label) return;

    const char *reaction = correct ?
                           quiz_questions[current_question_index].correct_reaction :
                           quiz_questions[current_question_index].wrong_reaction;

    lv_label_set_text(ui.reaction_label, reaction);
    lv_obj_set_style_text_color(ui.reaction_label,
                                correct ? LV_COLOR_GREEN : LV_COLOR_RED,
                                LV_PART_MAIN);

    lv_obj_clear_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
}

static void show_winner_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BLUE, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);

