esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    // Show center label
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Herzlichen Glückwunsch!\n\nDu hast gewonnen!\n\nDer Code zum Finale lautet: 7777");
}

static void show_fail_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, LV_COLOR_RED, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Show center + instruction
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Leider hat es nicht geklappt\n\nMöchtest du es nochmal versuchen?");

    lv_obj_clear_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.fail_instr_label, "Grün: Neuer Versuch\nRot (lange drücken): Spiel beenden");
}

static void show_shutdown_prompt_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_ORANGE_DARK, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Show center label
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Press any button to shutdown");
}

static void show_start_screen_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.reaction_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }
    lv_obj_add_flag(ui.fail_instr_label, LV_OBJ_FLAG_HIDDEN);

    // Show center label with welcome message
    lv_obj_clear_flag(ui.center_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.center_label, "Herzlich Willkommen im Quiz-Hotel");

    // Show instructions label
    lv_obj_clear_flag(ui.start_instr_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.start_instr_label,
        "Für eine richtige Antwort bekommst du einen Punkt, für eine falsche wird ein Punkt abgezogen. "
        "Danach geht es automatisch mit der nächsten Frage weiter. Bei 10 Punkten erhälst du eine Belohnung. "
        "Drücke einen der Knöpfe, wenn du bereit bist.");
}

// === Quiz timer callback (only uses LVGL safely, no deletes) ================

static void quiz_timer_callback(lv_timer_t *timer)
{
    static int second_counter = 0;
    static int winner_counter = 0;
    static int fail_counter = 0;

    second_counter++;

    ESP_LOGV("QUIZ", "Timer callback: state=%d, second_counter=%d", quiz_state, second_counter);

    switch (quiz_state) {
    case QUIZ_STATE_SHOWING_QUESTION: {
        ESP_LOGI("QUIZ", "Timer: SHOWING_QUESTION - selecting question");
        current_question_index = select_random_question();
        if (current_question_index == -1) {
            // All questions used
            if (score >= 10) {
                ESP_LOGI("QUIZ", "Timer: All questions used, score >= 10 - WINNER");
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for winner timer
            } else {
                ESP_LOGI("QUIZ", "Timer: All questions used, score < 10 - FAIL");
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for fail timer
            }
            second_counter = 0;
            break;
        }

        // Show a new question
        ESP_LOGI("QUIZ", "Timer: Showing question %d, setting state to WAITING_ANSWER", current_question_index);
        show_question_ui(current_question_index);
        quiz_state = QUIZ_STATE_WAITING_ANSWER;
        lv_timer_set_period(quiz_timer, 1000); // 1 second for countdown
        second_counter = 0;
        break;
    }

    case QUIZ_STATE_WAITING_ANSWER:
        if (second_counter >= 1) {
            timer_remaining--;
            update_countdown_display();
            second_counter = 0;

            if (timer_remaining <= 0) {
                // Time's up
                ESP_LOGI("QUIZ", "Timer: Time's up in WAITING_ANSWER - setting state to SHOWING_REACTION");
                quiz_state = QUIZ_STATE_SHOWING_REACTION;
                bool correct = false;
                if (score > 0) score--;
                tries++;
                update_score_display();
                show_reaction_ui(correct);
                lv_timer_set_period(quiz_timer, 2000); // show reaction 2 sec
                second_counter = 0;
            }
        }
        break;

    case QUIZ_STATE_SHOWING_REACTION:
        if (second_counter >= 2) {
            if (score >= 10) {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, score >= 10 - WINNER");
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else if (tries >= 50) {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, tries >= 50 - FAIL");
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, continuing to next question");
                quiz_state = QUIZ_STATE_SHOWING_QUESTION;
                lv_timer_set_period(quiz_timer, 100);
            }
            second_counter = 0;
        }
        break;

    case QUIZ_STATE_WINNER:
        winner_counter++;
        if (winner_counter >= 150) {  // 15 seconds
            ESP_LOGI("QUIZ", "Timer: Winner timeout - SHUTDOWN_PROMPT");
            quiz_state = QUIZ_STATE_SHUTDOWN_PROMPT;
            show_shutdown_prompt_ui();
            winner_counter = 0;
        }
        break;

    case QUIZ_STATE_FAIL:
        fail_counter++;
        if (fail_counter >= 50) {  // 5 seconds
            // Refresh fail screen occasionally (optional)
            show_fail_ui();
            fail_counter = 0;
        }
        break;

    case QUIZ_STATE_SHUTDOWN_PROMPT:
    case QUIZ_STATE_START_SCREEN:
    case QUIZ_STATE_IDLE:
    default:
        // nothing
        break;
    }
}

// === Answer handling in LVGL context via lv_async_call =======================

