esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
        esp_err_t ret = iot_button_new_gpio_device(&btn_cfg, &btn_gpio_cfg, &buttons[i].handle);
        if (ret != ESP_OK) {
            ESP_LOGE("BUTTON", "Failed to create %s button device: %s",
                     color_names[i], esp_err_to_name(ret));
        } else {
            iot_button_register_cb(buttons[i].handle, BUTTON_PRESS_DOWN,       NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_PRESS_UP,         NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_PRESS_REPEAT,     NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_PRESS_REPEAT_DONE,NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_SINGLE_CLICK,     NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_DOUBLE_CLICK,     NULL, button_event_cb, NULL);

            button_event_args_t args = {
                .multiple_clicks.clicks = 3,
            };
            iot_button_register_cb(buttons[i].handle, BUTTON_MULTIPLE_CLICK, &args, button_event_cb, (void *)3);

            iot_button_register_cb(buttons[i].handle, BUTTON_LONG_PRESS_START, NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_LONG_PRESS_HOLD,  NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_LONG_PRESS_UP,    NULL, button_event_cb, NULL);
            iot_button_register_cb(buttons[i].handle, BUTTON_PRESS_END,        NULL, button_event_cb, NULL);

            ESP_LOGI("BUTTON", "%s button initialized on GPIO%d",
                     color_names[i], buttons[i].gpio_num);
        }
    }

    ESP_LOGI("QUIZ", "Quiz system initialized. Starting quiz...");
    start_quiz();

    while (true) {
        lv_timer_handler();                 // LVGL processing
        vTaskDelay(pdMS_TO_TICKS(5));       // 5 ms tick
    }
}
